//  1. 无重复字符的最长子串	
//  1888. 合并两个有序数组	
//  17129. 求根到叶子节点数字之和	
//  15112. 路径总和	
//  1353. 最大子序和	
//  121. 两数之和	
//  11165. 比较版本号	
//  11215. 数组中的第K个最大元素	
//  10209. 长度最小的子数组	8剑指 Offer 
//  22. 链表中倒数第k个节点	
//  8415. 字符串相加	
//  846. 全排列	
//  8206. 反转链表	
//  7102. 二叉树的层序遍历	
//  670. 爬楼梯	
//  654. 螺旋矩阵	
//  5200. 岛屿数量	
//  5230. 二叉搜索树中第K小的元素	
//  515. 三数之和	
//  5141. 环形链表	
//  5429. N叉树的层序遍历	
//  5226. 翻转二叉树	
//  4121. 买卖股票的最佳时机	
//  4718. 最长重复子数组	
//  4160. 相交链表	
//  4695. 岛屿的最大面积	
//  462. 不同路径	4剑指 Offer
//  62. 圆圈中最后剩下的数字	
//  494. 二叉树的中序遍历	
//  3104. 二叉树的最大深度	
//  321. 合并两个有序链表	
//  3509. 斐波那契数	
//  3113. 路径总和 II	
//  3468. 验证IP地址	
//  331. 下一个排列	
//  320. 有效的括号	
//  3349. 两个数组的交集	
//  35. 最长回文子串	
//  3236. 二叉树的最近公共祖先	
//  3146. LRU缓存机制	
//  3322. 零钱兑换	
//  2394. 字符串解码
//  219. 删除链表的倒数第N个节点	2剑指 Offer 
//  24. 反转链表	
//  242. 接雨水	
//  2155. 最小栈	
//  2169. 多数元素	2剑指 Offer 
//  21. 调整数组顺序使奇数位于偶数前面	
//  267. 二进制求和	
//  2144. 二叉树的前序遍历	
//  2198. 打家劫舍	
//  214. 最长公共前缀	2补充题
//  3. 求区间最小数乘区间和的最大值	
//  2199. 二叉树的右视图	2剑指 Offer 
//  09. 用两个栈实现队列	
//  256. 合并区间	
//  2300. 最长上升子序列	2剑指 Offer 
//  38. 字符串的排列	2补充题14. 阿拉伯数字转中文数字	
//  2400. 第N个数字	
//  2101. 对称二叉树	2剑指 Offer 
//  48. 最长不含重复字符的子字符串	
//  1680. 验证回文字符串 Ⅱ	
//  1124. 二叉树中的最大路径和	
//  1221. 最大正方形	
//  198. 验证二叉搜索树	
//  11047. 删除字符串中的所有相邻重复项	
//  144. 通配符匹配	
//  1130. 被围绕的区域	
//  116. 最接近的三数之和	
//  1498. 对角线遍历	
//  1224. 基本计算器	
//  04. 二维数组中的查找	
//  1443. 压缩字符串	
//  1142. 环形链表 II	
//  1984. 不含 AAA 或 BBB 的字符串	
//  1151. 翻转字符串里的单词	
//  1213. 打家劫舍 II	
//  1114. 二叉树展开为链表	
//  1109. 有序链表转换二叉搜索树	
//  1242. 有效的字母异位词	
//  1862. 和至少为 K 的最短子数组	
//  11498. 满足条件的子序列数目	
//  1257. 二叉树的所有路径	
//  163. 不同路径 II	
//  1609. 在系统中查找重复文件	
//  1232. 用栈实现队列	
//  139. 组合总和	1剑指 Offer 
//  10- I. 斐波那契数列	
//  1361. 轰炸敌人	
//  1525. 连续数组	
//  196. 不同的二叉搜索树	
//  1103. 二叉树的锯齿形层次遍历	
//  1717. 1比特与2比特字符	
//  11353. 最多可以参加的会议数目	1剑指 Offer 
//  63. 股票的最大利润	1剑指 Offer 
//  27. 二叉树的镜像	1LCP 
//  04. 覆盖	1剑指 Offer 
//  39. 数组中出现次数超过一半的数字	1剑指 Offer 
//  07. 重建二叉树	
//  1829. 连续整数求和	
//  11356. 根据数字二进制下 
//  1 的数目排序	
//  16. Z 字形变换	
//  1704. 二分查找	
//  1111. 二叉树的最小深度	
//  1105. 从前序与中序遍历序列构造二叉树	
//  1783. 二叉搜索树节点最小距离	1剑指 Offer 
//  42. 连续子数组的最大和	
//  155. 跳跃游戏	
//  12. 两数相加	
//  11410. HTML 实体解析器	
//  1125. 验证回文串	
//  112. 整数转罗马数字	
//  145. 跳跃游戏 II	
//  143. 字符串相乘